## Pandas

### Series

Series is a one-Dimentional array - like object containing data and labels (or Index).

Series can be created with different data inputs.

* ndarray
* dict
* scalar
* list

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Create Series from a list
first_series = pd.Series(list("abcdef"))
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [3]:
# Creating Series from ndarray

np_country = np.array(['Luxemburg','Norway','Japan','Switzerland','US','UAE','Russia','Denmark'])

s_country = pd.Series(np_country)

print(s_country)

0      Luxemburg
1         Norway
2          Japan
3    Switzerland
4             US
5            UAE
6         Russia
7        Denmark
dtype: object

In [4]:
# Create Series from Dict

dict_country_gdp = pd.Series([111.222,123.345,343.345,666.453],index=['Luxemburg','Norway','Japan','Switzerland'])
print(dict_country_gdp)

Luxemburg      111.222
Norway         123.345
Japan          343.345
Switzerland    666.453
dtype: float64

In [5]:
# Create series from Scalar

scalar_series = pd.Series(5. , index=['a','b','c','d','e'])
print(scalar_series)

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [6]:
# Accessing elements from the series

dict_country_gdp[0]

111.222

In [7]:
dict_country_gdp[0:3]

Luxemburg    111.222
Norway       123.345
Japan        343.345
dtype: float64

In [8]:
# Looking by the name or Index
dict_country_gdp["Japan"]

343.345

In [9]:
# Lookup by Position
dict_country_gdp.iloc[0]

111.222

### Vectoized operations in Series

In [10]:
first_vector_series = pd.Series([1,2,3,4],index=['a','b','c','d'])
second_vector_series = pd.Series([10,20,30,40],index=['a','b','c','d'])

first_vector_series + second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [11]:
second_vector_series = pd.Series([10,20,30,40],index=['a','d','c','b'])

first_vector_series + second_vector_series

a    11
b    42
c    33
d    24
dtype: int64

In [12]:
second_vector_series = pd.Series([10,20,30,40],index=['a','b','e','f'])

first_vector_series + second_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

# DataFrame

DataFrame is a two-dimensional labeled data structure with columns of potentially different data types.

#### Data inputs

* ndarray
* dict
* list
* Series
* DataFrame

In [13]:
# Create a DataFrame from the List

olympic_data_list = {
                    'HostCity':['London','Beijing','Athens','Sydney','Atlanta'],
                    'Year':[2012,2008,2004,2000,1996],
                    'No.of.Participating Countries':[205,204,201,200,197]
                    }

df_olympics_data = pd.DataFrame(olympic_data_list)

df_olympics_data

  HostCity  Year  No.of.Participating Countries
0   London  2012                            205
1  Beijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197

In [14]:
# Create DataFrame from a Dict

olympic_data_dict = {'London':{2012:205},
                    'Beijing':{2008:204}}

df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

df_olympic_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

### View DataFrame

We can view the DataFrame by referring to its column name or by using describe function.

In [15]:
df_olympics_data.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [16]:
df_olympics_data.describe

<bound method NDFrame.describe of   HostCity  Year  No.of.Participating Countries
0   London  2012                            205
1  Beijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197>

In [17]:
# Create DataFrame from dict of Series

olympics_series_participation = pd.Series([205,204,203,202,200],index=[2012,2008,2004,2000,1996])
olympics_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],index=[2012,2008,2004,2000,1996])

df_olympics_series = pd.DataFrame({'No of Participating Countries': olympics_series_participation,
                                  'HostCity': olympics_series_country})

df_olympics_series

      No of Participating Countries HostCity
2012                            205   London
2008                            204  Beijing
2004                            203   Athens
2000                            202   Sydney
1996                            200  Atlanta

In [18]:
# Create DataFrame from ndarray

np_array = np.array([2012,2008,2004,2000])
dict_ndarray = {'year':np_array}

df_ndarray = pd.DataFrame(dict_ndarray)

df_ndarray

   year
0  2012
1  2008
2  2004
3  2000

In [19]:
# Create DataFrame from DataFrame

df_from_df = pd.DataFrame(df_olympics_series)

df_from_df

      No of Participating Countries HostCity
2012                            205   London
2008                            204  Beijing
2004                            203   Athens
2000                            202   Sydney
1996                            200  Atlanta

In [20]:
# View top 2 records

df_olympics_series.head(2)

      No of Participating Countries HostCity
2012                            205   London
2008                            204  Beijing

In [21]:
# View Last 3 records

df_olympics_series.tail(3)

      No of Participating Countries HostCity
2004                            203   Athens
2000                            202   Sydney
1996                            200  Atlanta

In [22]:
# View Indices of the Dataframe

df_olympics_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [23]:
# View columns of the Dataframe

df_olympics_series.columns

Index(['No of Participating Countries', 'HostCity'], dtype='object')

### Select Data

In [24]:
# Select HostCity Column

df_olympics_series["HostCity"]

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: HostCity, dtype: object

In [25]:
# Select No of Participating Countries Column

df_olympics_series["No of Participating Countries"]

2012    205
2008    204
2004    203
2000    202
1996    200
Name: No of Participating Countries, dtype: int64

In [26]:
# select label-location based access bt label

df_olympics_series.loc[2012]

No of Participating Countries       205
HostCity                         London
Name: 2012, dtype: object

In [27]:
# Integer-location based indexing by position

df_olympics_series.iloc[0:2]

      No of Participating Countries HostCity
2012                            205   London
2008                            204  Beijing

In [28]:
# Integer-location based data selection by index value

df_olympics_series.iat[3,1]

'Sydney'

In [29]:
# Select data elements by condition where no of participating countries are more than 203

df_olympics_series[df_olympics_series['No of Participating Countries']>203]

      No of Participating Countries HostCity
2012                            205   London
2008                            204  Beijing

## Missing Values

In [30]:
first_series = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
second_series = pd.Series([10,20,30,40,50],index=['c','e','f','g','h'])

sum_of_series = first_series + second_series

sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [31]:
# Handling missing values with functions

dropna_s = sum_of_series.dropna()

dropna_s

c    13.0
e    25.0
dtype: float64

In [32]:
# fillna

fillna_s = sum_of_series.fillna(0)

fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [33]:
# fill values with zeros before performing addition operation for missing indices
fill_NaN_with_zeros_before_sum = first_series.add(second_series,fill_value=0)

fill_NaN_with_zeros_before_sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

## Data Operation

In [34]:
df_movies_rating = pd.DataFrame({
    'movie 1': [5,4,3,3,2,1],
    'movie 2': [4,5,2,3,4,2]},
    index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

df_movies_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [35]:
# Custom function can be applied with the applymap method

def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    if rating == 2:
        return 'D'
    else:
        return 'E'

In [36]:
print(movie_grade(5))

A

In [37]:
df_movies_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       D
Ram         C       C
Ted         D       B
Paul        E       D

### Statistical functions

In [38]:
df_test_scores = pd.DataFrame({
    'Test 1': [95, 96, 84, 73, 88, 60],
    'Test 2': [75, 84, 56, 69, 90, 100]},
    index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [39]:
df_test_scores.max()

Test 1     96
Test 2    100
dtype: int64

In [40]:
df_test_scores.min()

Test 1    60
Test 2    56
dtype: int64

In [41]:
df_test_scores.mean()

Test 1    82.666667
Test 2    79.000000
dtype: float64

In [42]:
df_test_scores.std()

Test 1    13.909230
Test 2    15.697133
dtype: float64

### Data Operation using Groupby

In [43]:
df_president_name = pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],
                                 'last':['Bush','Clinton','Regan','Carter','Washington']})

df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [44]:
grouped = df_president_name.groupby('first')
grouped

In [45]:
grp_data = grouped.get_group('George')
grp_data

    first        last
0  George        Bush
4  George  Washington

### Data Operation - Sorting

In [46]:
df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

### Data Standardization

In [49]:
def standardize_tests(test):
    return (test-test.mean())/ test.std()

In [50]:
standardize_tests(df_test_scores['Test 1'])

Tom      0.886701
Jeff     0.958596
Peter    0.095860
Ram     -0.694982
Ted      0.383438
Paul    -1.629613
Name: Test 1, dtype: float64

In [51]:
def standardize_test_score(datafrm):
    return datafrm.apply(standardize_tests)

In [52]:
standardize_test_score(df_test_scores)

         Test 1    Test 2
Tom    0.886701 -0.254824
Jeff   0.958596  0.318529
Peter  0.095860 -1.465236
Ram   -0.694982 -0.637059
Ted    0.383438  0.700765
Paul  -1.629613  1.337824

### Pandas Data Operations - Merge, Duplicate, Concatenation

In [56]:
# Define the student data frame with math data
df_student_math = pd.DataFrame({'student':['Tom','Jeff','Peter','Ram','Ted','David'],
                               'ID':[10,56,31,85,9,22]
                               })

In [57]:
# Define the student data frame with science data
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'],
                               'ID':[10,12,22]
                               })

In [58]:
# Merge two dataframes to form a single data frame with math and science data
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1   David  22

In [59]:
# Merge with Key on student
pd.merge(df_student_math,df_student_science, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [60]:
# Merge left join on key ID and also fill NaN values with X
pd.merge(df_student_math,df_student_science, on='ID', how='left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jeff  56         X
2     Peter  31         X
3       Ram  85         X
4       Ted   9         X
5     David  22     David

In [61]:
# Concatenate Dataframes
pd.concat([df_student_math,df_student_science],ignore_index=True)

  student  ID
0     Tom  10
1    Jeff  56
2   Peter  31
3     Ram  85
4     Ted   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [62]:
# Define a new dataframe with student survey data
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                      'ID':[10,56,10,85,9,56]
                                      })

In [66]:
# View the dataframe
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [68]:
# Check for Duplicate rows
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [69]:
# Drop the duplicate row by student
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [70]:
# Drop the duplicate row by ID
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

### File Read and Write Support

* read_csv / to_csv
* read_excel / to_excel
* read_json / to_json
* read_hdf / to_hdf
* read_clipboard / to_clipboard
* read_html / to_html
* read_pickle / to_pickle
* read_stata / to_stata
* read_sql / to_sql